app/controllers/chatrooms_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    if(params[:event_id])
      @event = Event.find(params[:event_id])
      @chatrooms = @event.chatrooms
      render json: @chatrooms, include: :event, status: :ok
    elsif(params[:user_id])
      @user = User.find(params[:user_id])

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @chatroom = Chatroom.find(params[:id])

INSERT INTO "chatrooms" ("title", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Yikes guys"], ["event_id", 1], ["created_at", "2019-04-10 16:24:33.627361"], ["updated_at", "2019-04-10 16:24:33.627361"]]
---
  def create
    @chatroom = Chatroom.new(chatroom_params)
    if @chatroom.save

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "chatrooms" SET "title" = $1, "event_id" = $2, "updated_at" = $3 WHERE "chatrooms"."id" = $4  [["title", "yeehaw"], ["event_id", 2], ["updated_at", "2019-04-08 18:30:55.473178"], ["id", 9]]
---
  def update
    @chatroom = Chatroom.find(params[:id])
    if @chatroom.update(chatroom_params)

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "chatrooms" WHERE "chatrooms"."id" = $1  [["id", 2]]
---
  def destroy
    @chatroom = Chatroom.find(params[:id])
    @chatroom.destroy