app/controllers/events_controller.rb

INSERT INTO "events" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "hello"], ["created_at", "2019-04-08 17:25:01.693394"], ["updated_at", "2019-04-08 17:25:01.693394"]]
---
  def create
    @event = Event.new(event_params)
    @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "events" SET "title" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["title", "yellow"], ["updated_at", "2019-04-08 17:26:35.472942"], ["id", 5]]
---
  def update
    @event = Event.find(params[:id])
    @event.update_attributes(event_params)