app/controllers/posts_controller.rb

  def index
    @chatroom = Chatroom.find(params[:chatroom_id])
---
SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @chatroom = Chatroom.find(params[:chatroom_id])
    @post = Post.new(post_params)
    if @post.save
      @chatroom.posts.push(@post)
---
SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "posts" ("text", "user_id", "chatroom_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "yahehaw"], ["user_id", 1], ["chatroom_id", 2], ["created_at", "2019-04-08 18:37:01.351617"], ["updated_at", "2019-04-08 18:37:01.351617"]]
UPDATE "posts" SET "text" = $1, "chatroom_id" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["text", "square"], ["chatroom_id", 1], ["updated_at", "2019-04-09 02:47:47.854402"], ["id", 4]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "text" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["text", "I kinda like it now"], ["updated_at", "2019-04-08 18:43:50.805678"], ["id", 2]]