app/controllers/users_controller.rb

  def destroy
    if(params[:user_id])
      @user = User.find(params[:user_id])
      @user.chatrooms.delete(params[:chatroom_id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]