app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "users" ("email", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "kiki@gmail.com"], ["username", "kiki"], ["created_at", "2019-04-08 22:18:38.387316"], ["updated_at", "2019-04-08 22:18:38.387316"]]
SELECT  1 AS one FROM "chatrooms" INNER JOIN "chatrooms_users" ON "chatrooms"."id" = "chatrooms_users"."chatroom_id" WHERE "chatrooms_users"."user_id" = $1 AND "chatrooms"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    if(params[:user_id])
      if(params[:user_id].to_i == current_user.id)
        @user = User.find(params[:user_id])
        @chatroom = Chatroom.find(params[:chatroom_id])
        @user.chatrooms << @chatroom unless @user.chatrooms.include?(@chatroom)
      else
        render json: { errors: "unauthorized" }
      end
    else
      email = params[:email]
      password = params[:password]
      username = params[:username]

      new_user = User.new({
        password: password,
        email: email,
        username: username
      })

      if new_user.valid?
        new_user.save!

SELECT "users".* FROM "users"
---
  def login
    email = params[:email]
    password = params[:password]

    user = User.find_from_credentials email, password

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "chatrooms_users" ON "users"."id" = "chatrooms_users"."user_id" WHERE "chatrooms_users"."chatroom_id" = $1  [["chatroom_id", 6]]
---
  def index
    if(params[:chatroom_id])
      @chatroom = Chatroom.find(params[:chatroom_id])
      @users = @chatroom.users
      render json: @users, include: :chatrooms, status: :ok
    else
      @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$SPHpyEZc.z3FCdfwLbeoReov9wgZtM/1c0p4aO2gFpOhmWSis1/3u"], ["updated_at", "2019-04-09 03:50:25.721585"], ["id", 8]]
---
  def update
    @user = User.find(params[:id])

    if @user.id == current_user.id
      email = params[:email]
      password = params[:password]
      username = params[:username]

      @user.update!({
        password: password,
        email: email,
        username: username
      })

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 8]]
SELECT  "chatrooms".* FROM "chatrooms" INNER JOIN "chatrooms_users" ON "chatrooms"."id" = "chatrooms_users"."chatroom_id" WHERE "chatrooms_users"."user_id" = $1 AND "chatrooms"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    if(params[:user_id])
      if(params[:user_id].to_i == current_user.id)
        @user = User.find(params[:user_id])
        @user.chatrooms.delete(params[:chatroom_id])
      else
        render json: { errors: "unauthorized" }
      end
    else
      @user = User.find(params[:id])
      if @user.id == current_user.id
        @user.destroy